import React from 'react';

class Protocol extends React.Component { // eslint-disable-line 
  render() {
    return (
      <div id="wrapper" style={{ padding: '10px' }}> 
        <center><strong>《全占会员 服务使用协议》</strong> </center>
        <p>本协议由您与北京诠绽文化咨询有限公司共同缔结，本协议具有合同效力，您必须完全 同意本协议，才能够享受本协议提供的全占会员服务。
本协议中“全占会员服务”指在“全占全占”腾讯公众微信号(服务号及订阅号及该服 务号相关衍生服务)上在线播出的音频、视频、图片及文字推送。
本协议中“用户”是指具有完全民事行为能力的全占会员服务使用者。
注册者或使用者资格:您确认，在您完成注册全占会员服务用户(包括但不限于通过付 费购买会员服务、赠送使用会员服务及给微信技术授权在全占公众号免费阅读的用户)或我 们允许的方式实际使用全占会员服务时，您应当是具备完全民事权利能力和完全民事行为能 力的自然人、法人或其他组织。若您不具备前述主体资格，则您及您的监护人应承担因此而 导致的一切后果，且我们有权注销您的全占会员账户，并向您及您的监护人索偿。<br />
          一 、接受协议及生效.<br />
          您应当在使用全占会员服务(以下简称“全占”)之前认真阅读全部会员服务协议(以
下简称“协议”)内容。如您对协议有任何疑问，应向全占咨询。但无论您事实上是否在使 用全占服务之前认真阅读了本协议内容，只要您使用全占服务，则本协议即生效，并对您产 生约束，届时您不应以未阅读本协议内容或者未获得全占对您问询的解答等理由，主张本协 议无效，或要求撤销本协议。您承诺接受并遵守本协议的约定。如果您不同意本协议的约定， 您应立即停止使用，一旦您注册成为全占会员服务用户或已实际使用该服务，便表示您已经 完全理解并同意接受本协议。您的注册行为或使用行为将视为对本协议的接受，并同意接受 本协议各项条款的约束。全占可随时自行全权决定更改本协议，如您不同意相关变更，则应 停止使用全占之服务，如果您继续使用全占提供的服务，则表示您已无条件接受修改后的服 务使用协议，除另行明确声明外，任何使我们的服务内容范围或功能变更的新内容均受本协 议约束。<br />
          二.服务内容.<br />
          2.1 除非另有明确规定，增加或强化全占目前服务的任何新功能，包括新产品以及新增的服 务，均无条件的适用本协议。<br />
          2.2 全占向广大用户提供收费的网络服务和产品，用户使用免费网络服务不必向全占支付任 何费用。对于收费的网络服务或产品，全占在用户使用之前给予用户明确的提示，只有用户.<br />
          确认支付相关费用后，用户才能使用该收费网络服务或产品。如果用户拒绝支付相关费用， 则全占有权不向用户提供该收费网络服务或产品。<br />
          2.3 用户自行负担使用全占所需的相关设备(如个人电脑、手机、及其他与接入互联网或移 动网有关的装置)及所需的费用(如为接入互联网而支付的电话费及上网费、为使用移动网 而支付的手机费等)。<br />
          三.用户使用规则.<br />
          3.1 用户有责任维持自己所注册的或所使用的账号和密码的机密安全，用户应对您的账户和 密码的安全，以及任何人利用您的密码及帐户所进行的活动负完全的责任，全占无法对非法 或未经您授权使用您帐号及密码的行为作出甄别，因此全占不承担任何责任。如果发现任何 人不当使用您的账户或有任何其他可能危及您的账户安全的情形时，您应当立即以有效方式 通知全占，要求全占暂停相关服务。您理解全占对您的请求采取行动需要合理时间，全占对 在采取行动前已经产生的后果(包括但不限于您的任何损失)不承担任何责任。除非有法律 规定或司法裁定，且征得全占的同意，否则，账户和密码不得以任何方式转让、赠与或继承; 用户应当准确填写并及时更新您提供的联系方式，以便全占或其他用户与您进行有效联系， 因通过这些联系方式无法与您取得联系，导致您在使用全占服务过程中产生任何损失或增加 费用的，应由您完全独自承担。<br />
          3.2 用户在全占发布信息(包括用户名、上传评论及其他内容等)时，必须遵守国家有关法 律规定，并承担一切因自己发布信息不当导致的民事、行政和/或刑事法律责任。用户在全 占所发布的信息(包括用户名、上传评论以及其他内容)，不得含有以下任何内容:<br />
          &emsp;&emsp;1.违反宪法确定的基本原则的;<br />
          &emsp;&emsp;2.危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的;<br />
          &emsp;&emsp;3.损害国家荣誉和利益，攻击党和政府的;<br />
          &emsp;&emsp;4.煽动民族仇恨、民族歧视，破坏民族团结、破坏国家、地区间友好关系的;<br />
          &emsp;&emsp;5.违背中国民族传统美德、社会公德、伦理道德、以及社会主义精神文明的;<br />
          &emsp;&emsp;6.破坏国家宗教政策，宣扬邪教和封建迷信的;<br />
          &emsp;&emsp;7.散布谣言或不实信息，扰乱社会秩序，破坏社会稳定的;<br />
          &emsp;&emsp;8.删掉、组织、教唆恐怖活动、非法集会、结社、游行、示威、聚众扰乱社会秩序的;<br />
          &emsp;&emsp;9.散布淫秽、色情、赌博、暴力、恐怖或者教唆犯罪的;<br />
          &emsp;&emsp;10.侮辱或诽谤他人，侵害他人合法权益的;<br />
          &emsp;&emsp;11.侵犯他人肖像权、姓名权、名誉权、隐私权或其他人身权利的;<br />
          &emsp;&emsp;12.使用谩骂、辱骂、中伤、恐吓、诅咒等不文明语言的;<br />
          &emsp;&emsp;13.以非法民间组织名义活动的;<br />
          &emsp;&emsp;14.侵犯他人著作权、信息网络传播权等合法权益的;<br />
          &emsp;&emsp;15.含有法律、行政法规禁止的其他内容的;<br />
          3.3 如果用户在全占发布信息时不能履行和遵守协议中的相关规定，为维护全占的形象、信 誉、安全，全占有权删除用户发布的相关信息，并对违反协议的用户做出封闭ID和/或暂时、 永久禁止在全占发布信息的处理，同时保留依法追究当事人法律责任的权利。此外，全占在 采取移除等相应措施后不为此向原发布人承担违约责任或其他法律责任，包括不承担因侵权 指控不成立而给原发布人带来损害的赔偿责任。<br />
          3.4 用户需独立对自己在全占上实施的行为承担法律责任。若用户的行为不符合本协议之规 定，全占有权做出独立判断立即取消用户服务账号。 用户若在全占上散布和传播反对、色 情或其他违反国家法律的信息，全占的系统记录有可能作为用户违反法律的证据。<br />
          3.5 用户在全占使用各项产品和/或服务的同时，有义务协助推广宣传全占以及产品和服务。<br />
          3.6 全占不对用户所发布信息的删除或储存失败承担任何责任。全占有权判定用户的行为是 否符合中国法律法规的规定以及全占服务条款的要求。如果用户违背了中国法律法规的规定 和服务条款的规定，全占有中断对其提供服务的权利。对于用户通过全占技术服务上传到全 占上可公开获取区域的任何内容即视为用户同意授权全占所有上述内容在全球范围内的免 费、不可撤销的无限期的并且可转让的非独家使用权，全占有权展示、散布及推广。<br />
          四、隐私保护.<br />
          4.1 全占保证不对外公开或向第三方提供单个用户的注册资料及用户在使用网络服务时存 储在全占的非公开内容，但下列情况除外:<br />
          4.1.1 事先获得用户的明确授权;<br />
          4.1.2 根据有关的法律法规要求;<br />
          4.1.3 按照相关政府主管部门的要求;<br />
          4.1.4 为维护社会公众的利益;<br />
          4.1.5 为维护全占的合法权益;<br />
          4.1.6 其他需要公开、编辑或透露个人信息的情况。<br />
          4.2 全占可能会与第三方合作向用户提供相关的网络服务，在此情况下，如第三方同意承担.<br />
          与全占同等的保护用户隐私的责任，则全占有权将用户的注册资料等提供给该第三方。<br />
          4.3 在不透露单个用户隐私资料的前提下，全占有权对整个用户数据库进行分析并对用户数 据库进行商业上的利用。<br />
          五、知识产权.<br />
          5.1 全占提供的网络服务中包含的任何文本、图片、图形、音频和/或视频资料均受版权、商 标和/或其它财产所有权法律的保护。未经相关权利人同意，上述资料均不得在任何媒体直 接或间接发布、播放、出于播放或发布目的而改写或再发行，或者被用于其他任何商业目的。 所有这些资料或资料的任何部分仅可作为私人用途而保存在某台计算机内。全占不就由上述 资料产生或在传送或递交全部或部分上述资料过程中产生的延误、不准确、错误或遗漏或从 中产生或由此产生的任何损害赔偿，以任何形式向用户或任何第三方负法律责任。<br />
          5.2 全占为提供网络服务而使用的任何软件(包括但不限于软件中所含的任何图像、照片、 动画、录像、录音、音乐、文字和附加程序、随附的帮助材料)的一切权利均属于该软件的 著作权人，未经该软件的著作权人许可，用户不得对该软件进行反向工程(reverse engineer), 反向编译(decompile)或反汇编.(disassemble)等。<br />
          六、免责声明.<br />
          6.1 用户明确同意其使用全占网络服务所存在的风险将完全由其本人承担;因其使用全占网 络服务所产生的一切后果也由其本人承担。全占对用户及任何第三方不承担任何责任。<br />
          6.2 全占不担保或保证网络服务一定能满足用户的需求，也不担保网络服务不会中断，对网 络服务的及时性、安全性、准确性也都不作任何担保和保证。<br />
          6.3 对于因不可抗力或全占不能控制的原因造成的网络服务中断或其它缺陷，导致会员服务 无法继续，全占会以最快的速度通知用户，但不承担由此对用户造成的任何损失并不退还会 员服务费，但将尽力减少因此而给用户造成的损失和影响。本协议所称之不可抗力意指不能 预见、不能避免并不能克服的客观情况，包括但不限于战争、台风、水灾、火灾、雷击或地 震、罢工、暴动、法定疾病、黑客攻击、网络病毒、电信部门技术管制、政府行为或任何其 它自然或人为造成的灾难等客观情况。<br />
          6.4 全占对于任何自本网站而获得的他人的信息、内容或者广告宣传等任何资讯(以下统称
“信息”)，不保证真实、准确和完整性。如果任何单位或个人通过上述“信息”而进行任何行 为，须自行甄别真伪和谨防风险，否则无论何种原因，本网站不对任何非与本网站直接发生 的交易和/或行为承担任何直接、间接、附带或衍生的损失和责任。<br />
          6.5 用户同意，对于全占向用户提供下列产品或者服务的质量缺陷本身及其引发的任何损失， 全占无需承担责任;<br />
          6.5.1 全占向用户免费提供的各项网络服务;<br />
          6.5.2 全占向用户赠送的任何产品或者服务;<br />
          6.5.3 全占向收费网络服务用户附赠的任何一种产品或者服务; 6.5.4 用户资料遭到未授权的使用或修改;<br />
          6.5.5 任何非因全占的原因而引起的与全占服务有关的其他损失。<br />
          七、通知送达.<br />
          7.1 本协议作用于全占对于用户所有的通知均可通过网页公告、公众号公告、电子邮件、手 机短信或其他常规的信件传送等方式进行;该等通知于发送之日视为已送达收件人。<br />
          7.2 用户对于全占的通知应当通过全占对外正式公布的通信地址、传真号码、电子邮件等联 系信息进行送达。<br />
          八、责权限制 用户明确了解并同意，基于以下原因造成的包括但不限于利润、信誉、应用、数据损失或其 它无形损失，全占不承担任何直接、间接、附带、特别、衍生性或惩罚性赔偿责任(即使全 占事先已被告知发生此种赔偿之可能性亦然):(i)我们的服务之使用或无法使用，(ii)为替换 从或通过我们的服务购买或取得之任何商品、数据、信息、服务、收到的讯息，或缔结之交 易而发生的成本，(iii)用户的传输数据遭到未获授权的存取或编造，(iv)任何第三方在我们 的服务中所做之声明或行为;或(v)与我们的服务相关的其它事宜，但本协议有明确规定 的除外。<br />
          九、服务的修改 全占有权于任何时间暂时或永久修改或终止我们的服务(或其他任何产品)，而无论其通知 与否。用户同意对于我们的服务所做的任何修改、暂停或终止，全占对用户和任何第三人均 无需承担任何责任。<br />
          十、终止服务.<br />
          10.1 如用户违反或被视为违反本服务协议中的内容，全占有权在不通知用户的情况下立即.<br />
          终止您已购买的所有服务，以及取消您的会员账户和使用权限，但不退还任何已缴纳的会员 服务费。<br />
          10.2 用户通过购买服务成为会员后，有权利不接受全占提供的服务或不使用会员服务，但 不获得会员服务费的退还。<br />
          十一、法律管辖与适用.<br />
          11.1 本服务协议的生效、履行、解释及争议的结局均适用于中华人民共和国法律。<br />
          11.2 如本协议内容或其执行发生任何争议，应尽量友好协商解决;协商不成时，则争议各方 均可向全占所在地人民法院提起诉讼。<br />
          11.3 如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其 余条款仍应有效并且有约束力;<br />
          11.4 本协议中的标题仅为方便而设，在解释本协议时应被忽略。 本协议最终解释权归全占所有。<br />
          特别提示:用户在进行注册之前，请确保本人已经完全理解并接受本协议之所有条款(尤其 是免责及终止条款)。<br />
          <center><strong>北京诠绽文化咨询有限公司 </strong> </center></p>
      </div>
    );
  }
}

export default Protocol;
